CantileverBeam_concurrentGroundMotion/Fluid/system/pressureSamplingPoints

/*--------------------------------*- C++ -*----------------------------------*  =========				 |
  \	  /  F ield		 | OpenFOAM: The Open Source CFD Toolbox
   \	/   O peration	 | Website:  https://openfoam.org
	\  /	A nd		   | Version:  10
	 \/	 M anipulation  |
\*----------------------------------------------------------------------------

Description
	Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

type			probes;
libs			("libsampling.so");
writeControl	timeStep;
writeInterval 	1;

fields 		(p);

probeLocations
(
);

// ************************************************************************* //

